cmsis-svd/cmsis-svd/data/Holtek/ht32f275x.xml
        <!--MCTM_CH2ICFR-->
        <register>
          <name>MCTM_CH2ICFR</name>
          <displayName>MCTM_CH2ICFR</displayName>
          <description>MCTM_CH2ICFR</description>
          <addressOffset>0x00000028</addressOffset>
          <size>32</size><!--Bits-->
          <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
          <fields>
            <field>
              <name>TI2F</name>
              <description>TI2F</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>CH2CCS</name>
              <description>CH2CCS</description>
              <bitRange>[17:16]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>CH2PSC</name>
              <description>CH2PSC</description>
              <bitRange>[19:18]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>RESERVED</name>
              <description>Reserved.</description>
              <bitRange>[31:20]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
          </fields>
        </register>
        <!--MCTM_CH3ICFR-->
        <register>
          <name>MCTM_CH3ICFR</name>
          <displayName>MCTM_CH3ICFR</displayName>
          <description>MCTM_CH3ICFR</description>
          <addressOffset>0x0000002C</addressOffset>
          <size>32</size><!--Bits-->
          <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
          <fields>
            <field>
              <name>TI3F</name>
              <description>TI3F</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>CH3CCS</name>
              <description>CH3CCS</description>
              <bitRange>[17:16]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>CH3PSC</name>
              <description>CH3PSC</description>
              <bitRange>[19:18]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>RESERVED</name>
              <description>Reserved.</description>
              <bitRange>[31:20]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
          </fields>
        </register>
        <!--MCTM_CH0OCFR-->
        <register>
          <name>MCTM_CH0OCFR</name>
          <displayName>MCTM_CH0OCFR</displayName>
          <description>MCTM_CH0OCFR</description>
          <addressOffset>0x00000040</addressOffset>
          <size>32</size><!--Bits-->
          <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
          <fields>
            <field>
              <name>CH0OM</name>
              <description>CH0OM</description>
              <bitRange>[2:0]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>REF0CE</name>
              <description>REF0CE</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>CH0PRE</name>
              <description>CH0PRE</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>CH0IMAE</name>
              <description>CH0IMAE</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>RESERVED</name>
              <description>Reserved.</description>
              <bitRange>[31:6]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
          </fields>
        </register>
        <!--MCTM_CH1OCFR-->
        <register>
          <name>MCTM_CH1OCFR</name>
          <displayName>MCTM_CH1OCFR</displayName>
          <description>MCTM_CH1OCFR</description>
          <addressOffset>0x00000044</addressOffset>
          <size>32</size><!--Bits-->
          <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
          <fields>
            <field>
              <name>CH1OM</name>
              <description>CH1OM</description>
              <bitRange>[2:0]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>REF1CE</name>
              <description>REF1CE</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>CH1PRE</name>
              <description>CH1PRE</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>CH1IMAE</name>
              <description>CH1IMAE</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>RESERVED</name>
              <description>Reserved.</description>
              <bitRange>[31:6]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
          </fields>
        </register>
        <!--MCTM_CH2OCFR-->
        <register>
          <name>MCTM_CH2OCFR</name>
          <displayName>MCTM_CH2OCFR</displayName>
          <description>MCTM_CH2OCFR</description>
          <addressOffset>0x00000048</addressOffset>
          <size>32</size><!--Bits-->
          <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
          <fields>
            <field>
              <name>CH2OM</name>
              <description>CH2OM</description>
              <bitRange>[2:0]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>REF2CE</name>
              <description>REF2CE</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>CH2PRE</name>
              <description>CH2PRE</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>CH2IMAE</name>
              <description>CH2IMAE</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>RESERVED</name>
              <description>Reserved.</description>
              <bitRange>[31:6]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
          </fields>
        </register>
