cmsis-svd/cmsis-svd/data/Holtek/ht32f275x.xml
        <!--GPTM0_CH0CCR-->
        <register>
          <name>GPTM0_CH0CCR</name>
          <displayName>GPTM0_CH0CCR</displayName>
          <description>GPTM0_CH0CCR</description>
          <addressOffset>0x00000090</addressOffset>
          <size>32</size><!--Bits-->
          <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
          <fields>
            <field>
              <name>CH0CCV</name>
              <description>CH0CCV</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>RESERVED</name>
              <description>Reserved.</description>
              <bitRange>[31:16]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
          </fields>
        </register>
        <!--GPTM0_CH1CCR-->
        <register>
          <name>GPTM0_CH1CCR</name>
          <displayName>GPTM0_CH1CCR</displayName>
          <description>GPTM0_CH1CCR</description>
          <addressOffset>0x00000094</addressOffset>
          <size>32</size><!--Bits-->
          <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
          <fields>
            <field>
              <name>CH1CCV</name>
              <description>CH1CCV</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>RESERVED</name>
              <description>Reserved.</description>
              <bitRange>[31:16]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
          </fields>
        </register>
        <!--GPTM0_CH2CCR-->
        <register>
          <name>GPTM0_CH2CCR</name>
          <displayName>GPTM0_CH2CCR</displayName>
          <description>GPTM0_CH2CCR</description>
          <addressOffset>0x00000098</addressOffset>
          <size>32</size><!--Bits-->
          <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
          <fields>
            <field>
              <name>CH2CCV</name>
              <description>CH2CCV</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>RESERVED</name>
              <description>Reserved.</description>
              <bitRange>[31:16]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
          </fields>
        </register>
        <!--GPTM0_CH3CCR-->
        <register>
          <name>GPTM0_CH3CCR</name>
          <displayName>GPTM0_CH3CCR</displayName>
          <description>GPTM0_CH3CCR</description>
          <addressOffset>0x0000009C</addressOffset>
          <size>32</size><!--Bits-->
          <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
          <fields>
            <field>
              <name>CH3CCV</name>
              <description>CH3CCV</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>RESERVED</name>
              <description>Reserved.</description>
              <bitRange>[31:16]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <!--GPTM1-->
    <peripheral>
      <name>GPTM1</name>
      <version>1.0</version>
      <description>GPTM1</description>
      <groupName>GPTM</groupName>
      <baseAddress>0x4006F000</baseAddress>
      <size>32</size><!--Bits-->
      <resetValue>0x00000000</resetValue>
      <resetMask>0xffffffff</resetMask>
      <addressBlock>
        <offset>0x00000000</offset>
        <size>4096</size><!--Bytes-->
        <usage>registers</usage><!--registers/buffer/reserved-->
      </addressBlock>
      <interrupt>
        <name>GPTM1</name>
        <value>52</value>
      </interrupt>
      <registers>
        <!--GPTM1_CNTCFR-->
        <register>
          <name>GPTM1_CNTCFR</name>
          <displayName>GPTM1_CNTCFR</displayName>
          <description>GPTM1_CNTCFR</description>
          <addressOffset>0x00000000</addressOffset>
          <size>32</size><!--Bits-->
          <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
          <fields>
            <field>
              <name>UEVDIS</name>
              <description>UEVDIS</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>UGDIS</name>
              <description>UGDIS</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>CKDIV</name>
              <description>CKDIV</description>
              <bitRange>[9:8]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>CMSEL</name>
              <description>CMSEL</description>
              <bitRange>[17:16]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>DIR</name>
              <description>DIR</description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>RESERVED</name>
              <description>Reserved.</description>
              <bitRange>[31:25]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
          </fields>
        </register>
        <!--GPTM1_MDCFR-->
        <register>
          <name>GPTM1_MDCFR</name>
          <displayName>GPTM1_MDCFR</displayName>
          <description>GPTM1_MDCFR</description>
          <addressOffset>0x00000004</addressOffset>
          <size>32</size><!--Bits-->
          <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
          <fields>
            <field>
              <name>TSE</name>
              <description>TSE</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>SMSEL</name>
              <description>SMSEL</description>
              <bitRange>[10:8]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>MMSEL</name>
              <description>MMSEL</description>
              <bitRange>[18:16]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>SPMSET</name>
              <description>SPMSET</description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>RESERVED</name>
              <description>Reserved.</description>
              <bitRange>[31:25]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
          </fields>
        </register>
        <!--GPTM1_TRCFR-->
        <register>
          <name>GPTM1_TRCFR</name>
          <displayName>GPTM1_TRCFR</displayName>
          <description>GPTM1_TRCFR</description>
          <addressOffset>0x00000008</addressOffset>
          <size>32</size><!--Bits-->
          <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
          <fields>
            <field>
              <name>TRSEL</name>
              <description>TRSEL</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>ETF</name>
              <description>ETF</description>
              <bitRange>[11:8]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>ETIPSC</name>
              <description>ETIPSC</description>
              <bitRange>[13:12]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>ETIPOL</name>
              <description>ETIPOL</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>ECME</name>
              <description>ECME</description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>RESERVED</name>
              <description>Reserved.</description>
              <bitRange>[31:25]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
          </fields>
        </register>
        <!--GPTM1_CTR-->
        <register>
          <name>GPTM1_CTR</name>
          <displayName>GPTM1_CTR</displayName>
          <description>GPTM1_CTR</description>
          <addressOffset>0x00000010</addressOffset>
          <size>32</size><!--Bits-->
          <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
          <fields>
            <field>
              <name>TME</name>
              <description>TME</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>CRBE</name>
              <description>CRBE</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>CHCCDS</name>
              <description>CHCCDS</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>RESERVED</name>
              <description>Reserved.</description>
              <bitRange>[31:17]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
          </fields>
        </register>
        <!--GPTM1_CH0ICFR-->
        <register>
          <name>GPTM1_CH0ICFR</name>
          <displayName>GPTM1_CH0ICFR</displayName>
          <description>GPTM1_CH0ICFR</description>
          <addressOffset>0x00000020</addressOffset>
          <size>32</size><!--Bits-->
          <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
          <fields>
            <field>
              <name>TI0F</name>
              <description>TI0F</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>CH0CCS</name>
              <description>CH0CCS</description>
              <bitRange>[17:16]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>CH0PSC</name>
              <description>CH0PSC</description>
              <bitRange>[19:18]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>TI0SRC</name>
              <description>TI0SRC</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
          </fields>
        </register>
