cmsis-svd/cmsis-svd/data/Holtek/ht32f275x.xml
      </registers>
    </peripheral>
    <!--BFTM1-->
    <peripheral>
      <name>BFTM1</name>
      <version>1.0</version>
      <description>BFTM1</description>
      <groupName>BFTM</groupName>
      <baseAddress>0x40077000</baseAddress>
      <size>32</size><!--Bits-->
      <resetValue>0x00000000</resetValue>
      <resetMask>0xffffffff</resetMask>
      <addressBlock>
        <offset>0x00000000</offset>
        <size>4096</size><!--Bytes-->
        <usage>registers</usage><!--registers/buffer/reserved-->
      </addressBlock>
      <interrupt>
        <name>BFTN1</name>
        <value>58</value>
      </interrupt>
      <registers>
        <!--BFTM1_CR-->
        <register>
          <name>BFTM1_CR</name>
          <displayName>BFTM1_CR</displayName>
          <description>BFTM1_CR</description>
          <addressOffset>0x00000000</addressOffset>
          <size>32</size><!--Bits-->
          <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
          <fields>
            <field>
              <name>MIEN</name>
              <description>MIEN</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>OSM</name>
              <description>OSM</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>CEN</name>
              <description>CEN</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>RESERVED</name>
              <description>Reserved.</description>
              <bitRange>[31:3]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
          </fields>
        </register>
        <!--BFTM1_SR-->
        <register>
          <name>BFTM1_SR</name>
          <displayName>BFTM1_SR</displayName>
          <description>BFTM1_SR</description>
          <addressOffset>0x00000004</addressOffset>
          <size>32</size><!--Bits-->
          <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
          <fields>
            <field>
              <name>MIF</name>
              <description>MIF</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>RESERVED</name>
              <description>Reserved.</description>
              <bitRange>[31:1]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
          </fields>
        </register>
        <!--BFTM1_CNTR-->
        <register>
          <name>BFTM1_CNTR</name>
          <displayName>BFTM1_CNTR</displayName>
          <description>BFTM1_CNTR</description>
          <addressOffset>0x00000008</addressOffset>
          <size>32</size><!--Bits-->
          <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
          <fields>
            <field>
              <name>CNTR</name>
              <description>CNTR</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
          </fields>
        </register>
        <!--BFTM1_CMPR-->
        <register>
          <name>BFTM1_CMPR</name>
          <displayName>BFTM1_CMPR</displayName>
          <description>BFTM1_CMPR</description>
          <addressOffset>0x0000000C</addressOffset>
          <size>32</size><!--Bits-->
          <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
          <fields>
            <field>
              <name>CMP</name>
              <description>CMP</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <!--RTC-->
    <peripheral>
      <name>RTC</name>
      <version>1.0</version>
      <description>RTC</description>
      <groupName>RTC</groupName>
      <baseAddress>0x4006A000</baseAddress>
      <size>32</size><!--Bits-->
      <resetValue>0x00000000</resetValue>
      <resetMask>0xffffffff</resetMask>
      <addressBlock>
        <offset>0x00000000</offset>
        <size>4096</size><!--Bytes-->
        <usage>registers</usage><!--registers/buffer/reserved-->
      </addressBlock>
      <interrupt>
        <name>RTC</name>
        <value>20</value>
      </interrupt>
      <registers>
        <!--RTC_CNT-->
        <register>
          <name>RTC_CNT</name>
          <displayName>RTC_CNT</displayName>
          <description>RTC_CNT</description>
          <addressOffset>0x00000000</addressOffset>
          <size>32</size><!--Bits-->
          <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
          <fields>
            <field>
              <name>RTCCNT</name>
              <description>RTCCNT</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
          </fields>
        </register>
        <!--RTC_CMP-->
        <register>
          <name>RTC_CMP</name>
          <displayName>RTC_CMP</displayName>
          <description>RTC_CMP</description>
          <addressOffset>0x00000004</addressOffset>
          <size>32</size><!--Bits-->
          <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
          <fields>
            <field>
              <name>RTCCMP</name>
              <description>RTCCMP</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
          </fields>
        </register>
