cmsis-svd/cmsis-svd/data/Holtek/ht32f275x.xml
        <!--I2C0_SHPGR-->
        <register>
          <name>I2C0_SHPGR</name>
          <displayName>I2C0_SHPGR</displayName>
          <description>I2C0_SHPGR</description>
          <addressOffset>0x00000010</addressOffset>
          <size>32</size><!--Bits-->
          <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
          <fields>
            <field>
              <name>SHPG</name>
              <description>SHPG</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>RESERVED</name>
              <description>Reserved.</description>
              <bitRange>[31:16]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
          </fields>
        </register>
        <!--I2C0_SLPGR-->
        <register>
          <name>I2C0_SLPGR</name>
          <displayName>I2C0_SLPGR</displayName>
          <description>I2C0_SLPGR</description>
          <addressOffset>0x00000014</addressOffset>
          <size>32</size><!--Bits-->
          <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
          <fields>
            <field>
              <name>SLPG</name>
              <description>SLPG</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>RESERVED</name>
              <description>Reserved.</description>
              <bitRange>[31:16]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
          </fields>
        </register>
        <!--I2C0_DR-->
        <register>
          <name>I2C0_DR</name>
          <displayName>I2C0_DR</displayName>
          <description>I2C0_DR</description>
          <addressOffset>0x00000018</addressOffset>
          <size>32</size><!--Bits-->
          <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
          <fields>
            <field>
              <name>DATA</name>
              <description>DATA</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>RESERVED</name>
              <description>Reserved.</description>
              <bitRange>[31:8]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
          </fields>
        </register>
        <!--I2C0_TAR-->
        <register>
          <name>I2C0_TAR</name>
          <displayName>I2C0_TAR</displayName>
          <description>I2C0_TAR</description>
          <addressOffset>0x0000001C</addressOffset>
          <size>32</size><!--Bits-->
          <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
          <fields>
            <field>
              <name>TAR</name>
              <description>TAR</description>
              <bitRange>[9:0]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>RWD</name>
              <description>RWD</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>RESERVED</name>
              <description>Reserved.</description>
              <bitRange>[31:11]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
          </fields>
        </register>
        <!--I2C0_ADDMR-->
        <register>
          <name>I2C0_ADDMR</name>
          <displayName>I2C0_ADDMR</displayName>
          <description>I2C0_ADDMR</description>
          <addressOffset>0x00000020</addressOffset>
          <size>32</size><!--Bits-->
          <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
          <fields>
            <field>
              <name>ADDMR</name>
              <description>ADDMR</description>
              <bitRange>[9:0]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>RESERVED</name>
              <description>Reserved.</description>
              <bitRange>[31:10]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
          </fields>
        </register>
        <!--I2C0_ADDSR-->
        <register>
          <name>I2C0_ADDSR</name>
          <displayName>I2C0_ADDSR</displayName>
          <description>I2C0_ADDSR</description>
          <addressOffset>0x00000024</addressOffset>
          <size>32</size><!--Bits-->
          <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
          <fields>
            <field>
              <name>ADDSR</name>
              <description>ADDSR</description>
              <bitRange>[9:0]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>RESERVED</name>
              <description>Reserved.</description>
              <bitRange>[31:10]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
          </fields>
        </register>
        <!--I2C0_TOUT-->
        <register>
          <name>I2C0_TOUT</name>
          <displayName>I2C0_TOUT</displayName>
          <description>I2C0_TOUT</description>
          <addressOffset>0x00000028</addressOffset>
          <size>32</size><!--Bits-->
          <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
          <fields>
            <field>
              <name>TOUT</name>
              <description>TOUT</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>PSC</name>
              <description>PSC</description>
              <bitRange>[18:16]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>RESERVED</name>
              <description>Reserved.</description>
              <bitRange>[31:19]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
          </fields>
        </register>
