cmsis-svd/cmsis-svd/data/Holtek/ht32f275x.xml
      </registers>
    </peripheral>
    <!--PDMA-->
    <peripheral>
      <name>PDMA</name>
      <version>1.0</version>
      <description>PDMA</description>
      <groupName>PDMA</groupName>
      <baseAddress>0x40090000</baseAddress>
      <size>32</size><!--Bits-->
      <resetValue>0x00000000</resetValue>
      <resetMask>0xffffffff</resetMask>
      <addressBlock>
        <offset>0x00000000</offset>
        <size>4096</size><!--Bytes-->
        <usage>registers</usage><!--registers/buffer/reserved-->
      </addressBlock>
      <interrupt>
        <name>PDMA_CH0</name>
        <value>71</value>
      </interrupt>
      <interrupt>
        <name>PDMA_CH1</name>
        <value>72</value>
      </interrupt>
      <interrupt>
        <name>PDMA_CH2</name>
        <value>73</value>
      </interrupt>
      <interrupt>
        <name>PDMA_CH3</name>
        <value>74</value>
      </interrupt>
      <interrupt>
        <name>PDMA_CH4</name>
        <value>75</value>
      </interrupt>
      <interrupt>
        <name>PDMA_CH5</name>
        <value>76</value>
      </interrupt>
      <interrupt>
        <name>PDMA_CH6</name>
        <value>77</value>
      </interrupt>
      <interrupt>
        <name>PDMA_CH7</name>
        <value>78</value>
      </interrupt>
      <interrupt>
        <name>PDMA_CH8</name>
        <value>79</value>
      </interrupt>
      <interrupt>
        <name>PDMA_CH9</name>
        <value>80</value>
      </interrupt>
      <interrupt>
        <name>PDMA_CH10</name>
        <value>81</value>
      </interrupt>
      <interrupt>
        <name>PDMA_CH11</name>
        <value>82</value>
      </interrupt>
      <registers>
        <!--PDMA_CH0CR-->
        <register>
          <name>PDMA_CH0CR</name>
          <displayName>PDMA_CH0CR</displayName>
          <description>PDMA_CH0CR</description>
          <addressOffset>0x00000000</addressOffset>
          <size>32</size><!--Bits-->
          <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
          <fields>
            <field>
              <name>CHEN</name>
              <description>CHEN</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>SWTRIG</name>
              <description>SWTRIG</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>DWIDTH</name>
              <description>DWIDTH</description>
              <bitRange>[3:2]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>DSTAINC</name>
              <description>DSTAINC</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>DSTAMOD</name>
              <description>DSTAMOD</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>SRCAINC</name>
              <description>SRCAINC</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>SRCAMOD</name>
              <description>SRCAMOD</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>CHPRI</name>
              <description>CHPRI</description>
              <bitRange>[9:8]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>FIXAEN</name>
              <description>FIXAEN</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>AUTORL</name>
              <description>AUTORL</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>RESERVED</name>
              <description>Reserved.</description>
              <bitRange>[31:12]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
          </fields>
        </register>
        <!--PDMA_CH0SADR-->
        <register>
          <name>PDMA_CH0SADR</name>
          <displayName>PDMA_CH0SADR</displayName>
          <description>PDMA_CH0SADR</description>
          <addressOffset>0x00000004</addressOffset>
          <size>32</size><!--Bits-->
          <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
          <fields>
            <field>
              <name>SADR</name>
              <description>SADR</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
          </fields>
        </register>
        <!--PDMA_CH0DADR-->
        <register>
          <name>PDMA_CH0DADR</name>
          <displayName>PDMA_CH0DADR</displayName>
          <description>PDMA_CH0DADR</description>
          <addressOffset>0x00000008</addressOffset>
          <size>32</size><!--Bits-->
          <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
          <fields>
            <field>
              <name>DADR</name>
              <description>DADR</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
          </fields>
        </register>
