cmsis-svd/cmsis-svd/data/Holtek/ht32f275x.xml
        <!--PDMA_CH0CADR-->
        <register>
          <name>PDMA_CH0CADR</name>
          <displayName>PDMA_CH0CADR</displayName>
          <description>PDMA_CH0CADR</description>
          <addressOffset>0x0000000C</addressOffset>
          <size>32</size><!--Bits-->
          <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
          <fields>
            <field>
              <name>CDADR</name>
              <description>CDADR</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>CSADR</name>
              <description>CSADR</description>
              <bitRange>[31:16]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
          </fields>
        </register>
        <!--PDMA_CH0TSR-->
        <register>
          <name>PDMA_CH0TSR</name>
          <displayName>PDMA_CH0TSR</displayName>
          <description>PDMA_CH0TSR</description>
          <addressOffset>0x00000010</addressOffset>
          <size>32</size><!--Bits-->
          <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
          <fields>
            <field>
              <name>BLKLEN</name>
              <description>BLKLEN</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>BLKCNT</name>
              <description>BLKCNT</description>
              <bitRange>[31:16]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
          </fields>
        </register>
        <!--PDMA_CH0CTSR-->
        <register>
          <name>PDMA_CH0CTSR</name>
          <displayName>PDMA_CH0CTSR</displayName>
          <description>PDMA_CH0CTSR</description>
          <addressOffset>0x00000014</addressOffset>
          <size>32</size><!--Bits-->
          <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
          <fields>
            <field>
              <name>CBLKLEN</name>
              <description>CBLKLEN</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>CBLKCNT</name>
              <description>CBLKCNT</description>
              <bitRange>[31:16]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
          </fields>
        </register>
        <!--PDMA_CH1CR-->
        <register>
          <name>PDMA_CH1CR</name>
          <displayName>PDMA_CH1CR</displayName>
          <description>PDMA_CH1CR</description>
          <addressOffset>0x00000018</addressOffset>
          <size>32</size><!--Bits-->
          <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
          <fields>
            <field>
              <name>CHEN</name>
              <description>CHEN</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>SWTRIG</name>
              <description>SWTRIG</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>DWIDTH</name>
              <description>DWIDTH</description>
              <bitRange>[3:2]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>DSTAINC</name>
              <description>DSTAINC</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>DSTAMOD</name>
              <description>DSTAMOD</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>SRCAINC</name>
              <description>SRCAINC</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>SRCAMOD</name>
              <description>SRCAMOD</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>CHPRI</name>
              <description>CHPRI</description>
              <bitRange>[9:8]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>FIXAEN</name>
              <description>FIXAEN</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>AUTORL</name>
              <description>AUTORL</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>RESERVED</name>
              <description>Reserved.</description>
              <bitRange>[31:12]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
          </fields>
        </register>
