cmsis-svd/cmsis-svd/data/Holtek/ht32f275x.xml
        <!--CSIF_SMP-->
        <register>
          <name>CSIF_SMP</name>
          <displayName>CSIF_SMP</displayName>
          <description>CSIF_SMP</description>
          <addressOffset>0x00000014</addressOffset>
          <size>32</size><!--Bits-->
          <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
          <fields>
            <field>
              <name>CSML</name>
              <description>CSML</description>
              <bitRange>[12:8]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>RSML</name>
              <description>RSML</description>
              <bitRange>[20:16]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>SMP_EN</name>
              <description>SMP_EN</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
          </fields>
        </register>
        <!--CSIF_SMPCOL-->
        <register>
          <name>CSIF_SMPCOL</name>
          <displayName>CSIF_SMPCOL</displayName>
          <description>CSIF_SMPCOL</description>
          <addressOffset>0x00000018</addressOffset>
          <size>32</size><!--Bits-->
          <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
          <fields>
            <field>
              <name>CSM</name>
              <description>CSM</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
          </fields>
        </register>
        <!--CSIF_SMPROW-->
        <register>
          <name>CSIF_SMPROW</name>
          <displayName>CSIF_SMPROW</displayName>
          <description>CSIF_SMPROW</description>
          <addressOffset>0x0000001C</addressOffset>
          <size>32</size><!--Bits-->
          <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
          <fields>
            <field>
              <name>RSM</name>
              <description>RSM</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
          </fields>
        </register>
        <!--CSIF_FIFO0-->
        <register>
          <name>CSIF_FIFO0</name>
          <displayName>CSIF_FIFO0</displayName>
          <description>CSIF_FIFO0</description>
          <addressOffset>0x00000020</addressOffset>
          <size>32</size><!--Bits-->
          <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
          <fields>
            <field>
              <name>FIFODATA</name>
              <description>FIFODATA</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
          </fields>
        </register>
        <!--CSIF_FIFO1-->
        <register>
          <name>CSIF_FIFO1</name>
          <displayName>CSIF_FIFO1</displayName>
          <description>CSIF_FIFO1</description>
          <addressOffset>0x00000024</addressOffset>
          <size>32</size><!--Bits-->
          <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
          <fields>
            <field>
              <name>FIFODATA</name>
              <description>FIFODATA</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
          </fields>
        </register>
        <!--CSIF_FIFO2-->
        <register>
          <name>CSIF_FIFO2</name>
          <displayName>CSIF_FIFO2</displayName>
          <description>CSIF_FIFO2</description>
          <addressOffset>0x00000028</addressOffset>
          <size>32</size><!--Bits-->
          <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
          <fields>
            <field>
              <name>FIFODATA</name>
              <description>FIFODATA</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
          </fields>
        </register>
        <!--CSIF_FIFO3-->
        <register>
          <name>CSIF_FIFO3</name>
          <displayName>CSIF_FIFO3</displayName>
          <description>CSIF_FIFO3</description>
          <addressOffset>0x0000002C</addressOffset>
          <size>32</size><!--Bits-->
          <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
          <fields>
            <field>
              <name>FIFODATA</name>
              <description>FIFODATA</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
          </fields>
        </register>
        <!--CSIF_FIFO4-->
        <register>
          <name>CSIF_FIFO4</name>
          <displayName>CSIF_FIFO4</displayName>
          <description>CSIF_FIFO4</description>
          <addressOffset>0x00000030</addressOffset>
          <size>32</size><!--Bits-->
          <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
          <fields>
            <field>
              <name>FIFODATA</name>
              <description>FIFODATA</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
          </fields>
        </register>
